slowpoke/synthetic/chain-d2-http-sync/microbenchmark-8payload/0us-8-512-20000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=0.0
SLOWPOKE_DELAY_MICROS_SERVICE0=0.0
SLOWPOKE_DELAY_MICROS_SERVICE2=0.0
SLOWPOKE_POKER_BATCH_THRESHOLD=40000000
PROCESSING_TIME_SERVICE0=0.0
PROCESSING_TIME_SERVICE1=0.0
PROCESSING_TIME_SERVICE2=0.0
bash run.sh synthetic two-services 8 512 20000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   151.23ms  109.80ms 936.55ms   74.97%
    Req/Sec   440.07    101.45   797.00     71.67%
  Latency Distribution
     50%  128.30ms
     75%  199.30ms
     90%  295.75ms
     99%  518.55ms
  10519 requests in 3.02s, 6.11MB read
Requests/sec:   3478.24
Transfer/sec:      2.02MB
[run.sh] Speed is 3478.24, duration is 23
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d23s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
Running 23s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   640.35ms  705.34ms   4.71s    88.82%
    Req/Sec   138.67    128.54   787.00     76.98%
  Latency Distribution
     50%  410.17ms
     75%  852.36ms
     90%    1.41s 
     99%    3.53s 
  20000 requests in 23.00s, 11.62MB read
Requests/sec:    869.56
Transfer/sec:    517.15KB
------------------------------
stop time: 20.736674
stop time: 19.075291
stop time: 20.155331
stop time: 20.621831
stop time: 20.442986
stop time: 21.047470
stop time: 20.939386
stop time: 20.695882
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-6bff6cbd8c-x2g5c        1943m        75Mi            
service1-699f9649b9-jgtqs        230m         23Mi            
ubuntu-client-76886f6bbd-2sfw7   30m          20Mi            
[run.sh] Test finished with status 0